Purpose: Analyze CSV data to create final version

In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [3]:
# Test CSV file
properties_df = pd.read_csv("csv/listings_all.csv")
print(f"There are {len(properties_df)} rows.")
print(properties_df["airbnb_city"].value_counts())

There are 4726 rows.
Tampa        2960
Orlando      1420
Kissimmee     340
Name: airbnb_city, dtype: int64

In [4]:
properties_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4726 entries, 0 to 4725
Data columns (total 40 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      4720 non-null   float64
 1   property_id             4720 non-null   float64
 2   source                  4720 non-null   object
 3   status                  4726 non-null   object
 4   night_priceـnative      4720 non-null   float64
 5   night_price             4720 non-null   float64
 6   weekly_price            4720 non-null   float64
 7   monthly_price           4720 non-null   float64
 8   cleaning_fee_native     4232 non-null   float64
 9   num_of_baths            4720 non-null   float64
 10  num_of_rooms            4717 non-null   float64
 11  occupancy               4720 non-null   float64
 12  nights_booked           4720 non-null   float64
 13  rental_income           4720 non-null   float64
 14  airbnb_neighborhood_id  4720 non-null   float64
 15  name                    4676 non-null   object
 16  address                 4720 non-null   object
 17  airbnb_neighborhood     0 non-null      float64
 18  airbnb_city             4720 non-null   object
 19  state                   4720 non-null   object
 20  capacity_of_people      4720 non-null   float64
 21  zip                     4706 non-null   float64
 22  property_type           4720 non-null   object
 23  room_type               4720 non-null   object
 24  room_type_category      4720 non-null   object
 25  amenities               0 non-null      float64
 26  reviews_count           4720 non-null   float64
 27  start_rating            4718 non-null   float64
 28  reviews                 0 non-null      float64
 29  created_at              4720 non-null   object
 30  updated_at              4720 non-null   object
 31  last_seen               4720 non-null   object
 32  user_id                 4719 non-null   float64
 33  num_of_beds             4715 non-null   float64
 34  lat                     4720 non-null   float64
 35  lon                     4720 non-null   float64
 36  image                   4720 non-null   object
 37  url                     0 non-null      float64
 38  star_rating             4718 non-null   float64
 39  content                 6 non-null      object
dtypes: float64(26), object(14)
memory usage: 1.4+ MB

In [5]:
properties_df.columns

Index(['id', 'property_id', 'source', 'status', 'night_priceـnative',
       'night_price', 'weekly_price', 'monthly_price', 'cleaning_fee_native',
       'num_of_baths', 'num_of_rooms', 'occupancy', 'nights_booked',
       'rental_income', 'airbnb_neighborhood_id', 'name', 'address',
       'airbnb_neighborhood', 'airbnb_city', 'state', 'capacity_of_people',
       'zip', 'property_type', 'room_type', 'room_type_category', 'amenities',
       'reviews_count', 'start_rating', 'reviews', 'created_at', 'updated_at',
       'last_seen', 'user_id', 'num_of_beds', 'lat', 'lon', 'image', 'url',
       'star_rating', 'content'],
      dtype='object')

#### Obvious columns that need to be dropped are:
source, updated_at, last_seen, user_id, property_id, image, url, content
Can't see the rest of the columns until we delete these.

In [6]:
# Dropping verified, non-beneficial columns from dataset
properties_df = properties_df.drop(
    columns=["source", "updated_at", "last_seen", "user_id", "property_id", "name",
    "image", "url", "content", "created_at", "address", "airbnb_neighborhood", "state"
    ])
properties_df.head()

,id,status,night_priceـnative,night_price,weekly_price,monthly_price,cleaning_fee_native,num_of_baths,num_of_rooms,occupancy,nights_booked,rental_income,airbnb_neighborhood_id,airbnb_city,capacity_of_people,zip,property_type,room_type,room_type_category,amenities,reviews_count,start_rating,reviews,num_of_beds,lat,lon,star_rating
0,33453937.0,ACTIVE,110.0,108.0,0.0,0.0,110.0,2.0,2.0,48.0,177.0,1593.0,268906.0,Orlando,4.0,32822.0,Apartment,Entire home/apt,entire_home,NaN,78.0,5.0,NaN,2.0,28.5049,-81.2989,5.0
1,33454729.0,ACTIVE,237.0,434.0,0.0,0.0,185.0,4.0,5.0,76.0,279.0,10091.0,268914.0,Orlando,16.0,32805.0,House,Entire home/apt,entire_home,NaN,136.0,5.0,NaN,8.0,28.5216,-81.4037,5.0
2,33453571.0,ACTIVE,345.0,341.0,0.0,0.0,125.0,2.0,2.0,46.0,167.0,4746.0,268881.0,Orlando,5.0,32789.0,Condominium,Entire home/apt,entire_home,NaN,58.0,5.0,NaN,2.0,28.5916,-81.3521,5.0
3,33460647.0,ACTIVE,175.0,171.0,0.0,0.0,125.0,2.0,3.0,52.0,191.0,2722.0,269050.0,Orlando,6.0,32804.0,House,Entire home/apt,entire_home,NaN,6.0,5.0,NaN,3.0,28.5683,-81.3854,5.0
4,33456754.0,ACTIVE,62.0,63.0,300.0,950.0,30.0,1.0,1.0,94.0,342.0,1796.0,268987.0,Orlando,2.0,32819.0,Condominium,Entire home/apt,entire_home,NaN,109.0,5.0,NaN,1.0,28.4561,-81.4700,5.0

In [7]:
properties_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4726 entries, 0 to 4725
Data columns (total 27 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      4720 non-null   float64
 1   status                  4726 non-null   object
 2   night_priceـnative      4720 non-null   float64
 3   night_price             4720 non-null   float64
 4   weekly_price            4720 non-null   float64
 5   monthly_price           4720 non-null   float64
 6   cleaning_fee_native     4232 non-null   float64
 7   num_of_baths            4720 non-null   float64
 8   num_of_rooms            4717 non-null   float64
 9   occupancy               4720 non-null   float64
 10  nights_booked           4720 non-null   float64
 11  rental_income           4720 non-null   float64
 12  airbnb_neighborhood_id  4720 non-null   float64
 13  airbnb_city             4720 non-null   object
 14  capacity_of_people      4720 non-null   float64
 15  zip                     4706 non-null   float64
 16  property_type           4720 non-null   object
 17  room_type               4720 non-null   object
 18  room_type_category      4720 non-null   object
 19  amenities               0 non-null      float64
 20  reviews_count           4720 non-null   float64
 21  start_rating            4718 non-null   float64
 22  reviews                 0 non-null      float64
 23  num_of_beds             4715 non-null   float64
 24  lat                     4720 non-null   float64
 25  lon                     4720 non-null   float64
 26  star_rating             4718 non-null   float64
dtypes: float64(22), object(5)
memory usage: 997.0+ KB

In [8]:
# Review "id" column 
print("There are " + str(len(properties_df)) + " rows in the properties_df DataFrame.")
print("The id field has " + str(len(properties_df["id"].value_counts())) + " different types of values.")
duplicate_indicator = len(properties_df) - len(properties_df["id"].value_counts())
print(f"There are possibly {str(duplicate_indicator)} duplicates.")
properties_df[properties_df["id"].duplicated()]
# Should delete these duplicate rows

There are 4726 rows in the properties_df DataFrame.
The id field has 4720 different types of values.
There are possibly 6 duplicates.

,id,status,night_priceـnative,night_price,weekly_price,monthly_price,cleaning_fee_native,num_of_baths,num_of_rooms,occupancy,nights_booked,rental_income,airbnb_neighborhood_id,airbnb_city,capacity_of_people,zip,property_type,room_type,room_type_category,amenities,reviews_count,start_rating,reviews,num_of_beds,lat,lon,star_rating
4721,NaN,success,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4722,NaN,success,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4723,NaN,success,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4724,NaN,success,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4725,NaN,success,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
properties_df["id"].isna().sum()

6

In [10]:
properties_df = properties_df.dropna(axis=0, subset=["id"])
properties_df["id"].isna().sum()

0

In [11]:
properties_df["status"].value_counts()
#Should remove, useless

ACTIVE    4720
Name: status, dtype: int64

In [12]:
properties_df = properties_df.drop(columns=["status"])
properties_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4720 entries, 0 to 4719
Data columns (total 26 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      4720 non-null   float64
 1   night_priceـnative      4720 non-null   float64
 2   night_price             4720 non-null   float64
 3   weekly_price            4720 non-null   float64
 4   monthly_price           4720 non-null   float64
 5   cleaning_fee_native     4232 non-null   float64
 6   num_of_baths            4720 non-null   float64
 7   num_of_rooms            4717 non-null   float64
 8   occupancy               4720 non-null   float64
 9   nights_booked           4720 non-null   float64
 10  rental_income           4720 non-null   float64
 11  airbnb_neighborhood_id  4720 non-null   float64
 12  airbnb_city             4720 non-null   object
 13  capacity_of_people      4720 non-null   float64
 14  zip                     4706 non-null   float64
 15  property_type           4720 non-null   object
 16  room_type               4720 non-null   object
 17  room_type_category      4720 non-null   object
 18  amenities               0 non-null      float64
 19  reviews_count           4720 non-null   float64
 20  start_rating            4718 non-null   float64
 21  reviews                 0 non-null      float64
 22  num_of_beds             4715 non-null   float64
 23  lat                     4720 non-null   float64
 24  lon                     4720 non-null   float64
 25  star_rating             4718 non-null   float64
dtypes: float64(22), object(4)
memory usage: 995.6+ KB

In [13]:
properties_df["property_type"].value_counts()
# May want group Bungalow and below into an "Other" category

House                 1663
Apartment             1014
Condominium            542
Guest suite            420
Guesthouse             369
Townhouse              204
Bungalow               177
Villa                   82
Loft                    57
Serviced apartment      57
Tiny house              55
Vacation home           36
Cottage                 24
Other                   12
Cabin                    4
Farm stay                3
Chalet                   1
Name: property_type, dtype: int64

In [14]:
properties_df["room_type"].value_counts()
# Good candidate for removing, all the fields are the same

Entire home/apt    4720
Name: room_type, dtype: int64

In [15]:
properties_df["room_type_category"].value_counts()
# Good candidate for removing, all the fields are the same

entire_home    4720
Name: room_type_category, dtype: int64

In [16]:
# Removing for now. We can add "room_type_category" back if we have time to get each one
properties_df = properties_df.drop(columns=["room_type_category"])

In [17]:
properties_df["amenities"].value_counts()
# Believe this data is in another json dataset. We have to pull this data for each one
# for 4K records, that might not be enough time to do that

Series([], Name: amenities, dtype: int64)

In [18]:
# Removing for now. We can add "amenities" back if we have time to get each one
properties_df = properties_df.drop(columns=["amenities"])

In [19]:
properties_df["star_rating"].value_counts()

5.0    4478
4.0     227
3.0      12
1.0       1
Name: star_rating, dtype: int64

In [20]:
properties_df["start_rating"].value_counts()

5.0    4478
4.0     227
3.0      12
1.0       1
Name: start_rating, dtype: int64

In [21]:
# Believe "start_rating" column is a duplicate of star_rating
properties_df = properties_df.drop(columns=["start_rating"])

In [24]:
properties_df["star_rating"].isnull().sum()

2

In [ ]:
#properties_df.dropna(subset = ['star_rating'])

In [47]:
properties_df["reviews"].value_counts()

Series([], Name: reviews, dtype: int64)

In [48]:
# Removing for now. We can add "reviews" back if we have time to get each one
# Believe this data is in another json dataset. We have to pull this data for each one
# for 4K records, that might not be enough time to do that 
properties_df = properties_df.drop(columns=["reviews"])

In [49]:
properties_df.to_csv("csv/clean_all_property_data.csv", index=False)
properties_df.head(2)

,id,night_priceـnative,night_price,weekly_price,monthly_price,cleaning_fee_native,num_of_baths,num_of_rooms,occupancy,nights_booked,rental_income,airbnb_neighborhood_id,airbnb_city,capacity_of_people,zip,property_type,room_type,reviews_count,num_of_beds,lat,lon,star_rating
0,33453937.0,110.0,108.0,0.0,0.0,110.0,2.0,2.0,48.0,177.0,1593.0,268906.0,Orlando,4.0,32822.0,Apartment,Entire home/apt,78.0,2.0,28.5049,-81.2989,5.0
1,33454729.0,237.0,434.0,0.0,0.0,185.0,4.0,5.0,76.0,279.0,10091.0,268914.0,Orlando,16.0,32805.0,House,Entire home/apt,136.0,8.0,28.5216,-81.4037,5.0

In [50]:
len(properties_df.columns)

22

In [51]:
success_indicators_df = properties_df[["id","nights_booked", "occupancy", "rental_income", "star_rating"]]
success_indicators_df.to_csv("csv/success_indicators.csv", index=False)
success_indicators_df.head()

           id  nights_booked  occupancy  rental_income  star_rating
0  33453937.0          177.0       48.0         1593.0          5.0
1  33454729.0          279.0       76.0        10091.0          5.0
2  33453571.0          167.0       46.0         4746.0          5.0
3  33460647.0          191.0       52.0         2722.0          5.0
4  33456754.0          342.0       94.0         1796.0          5.0

In [52]:
success_indicators_df.describe()

                 id  nights_booked    occupancy  rental_income  star_rating
count  4.720000e+03    4720.000000  4720.000000    4720.000000  4718.000000
mean   3.352554e+07     124.407839    47.260381    2009.305720     4.945952
std    7.511158e+04      95.159355    25.933747    1555.012083     0.242425
min    3.334208e+07       0.000000     0.000000       0.000000     1.000000
25%    3.345688e+07      44.000000    26.000000     951.500000     5.000000
50%    3.357576e+07     101.000000    46.000000    1665.500000     5.000000
75%    3.357882e+07     192.000000    68.000000    2675.000000     5.000000
max    3.360290e+07     365.000000   100.000000   14850.000000     5.000000

In [53]:
property_location_df = properties_df[["id", "airbnb_city", "lat", "lon", "star_rating"]]
property_location_df.to_csv("csv/property_locations.csv", index=False)
property_location_df.head()

           id airbnb_city      lat      lon  star_rating
0  33453937.0     Orlando  28.5049 -81.2989          5.0
1  33454729.0     Orlando  28.5216 -81.4037          5.0
2  33453571.0     Orlando  28.5916 -81.3521          5.0
3  33460647.0     Orlando  28.5683 -81.3854          5.0
4  33456754.0     Orlando  28.4561 -81.4700          5.0

In [54]:
property_location_df.describe()

                 id          lat          lon  star_rating
count  4.720000e+03  4720.000000  4720.000000  4718.000000
mean   3.352554e+07    28.161419   -82.080250     4.945952
std    7.511158e+04     0.252045     0.521119     0.242425
min    3.334208e+07    27.856400   -82.605500     1.000000
25%    3.345688e+07    27.964100   -82.488225     5.000000
50%    3.357576e+07    28.010650   -82.446000     5.000000
75%    3.357882e+07    28.470600   -81.456575     5.000000
max    3.360290e+07    28.631200   -81.213000     5.000000